[
  {
    "title": "\"CLEAR CLEAN ESN\" Sprint EPIC 4G Galaxy SPH-D700*FRONT CAMERA*ANDROID*SLIDER*QWERTY KEYBOARD*TOUCH SCREEN",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 9,
    "seller": "5f5237a4c1beb1523fa3dbac",
    "price": 199.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3dabf",
        "rating": 5,
        "comment": "I feel so LUCKY to have found this used (phone to us & not used hard at all), phone on line from someone who upgraded and sold this one. My Son liked his old one that finally fell apart after 2.5+ years and didn't want an upgrade!! Thank you Seller, we really appreciate it & your honesty re: said used phone.I recommend this seller very highly & would but from them again!!"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dab6",
        "rating": 4,
        "comment": "nice phone, nice up grade from my pantach revue. Very clean set up and easy set up. never had an android phone but they are fantastic to say the least. perfect size for surfing and social media. great phone samsung"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da1f",
        "rating": 5,
        "comment": "Very pleased"
      }
    ]
  },
  {
    "title": "Cricket Samsung Galaxy Discover R740 Phone",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 5,
    "seller": "5f5237a4c1beb1523fa3dac4",
    "price": 24.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3db1b",
        "rating": 5,
        "comment": "Good"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da8d",
        "rating": 5,
        "comment": "she liked it"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dafc",
        "rating": 4,
        "comment": "GREAT BUY!"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da0c",
        "rating": 1,
        "comment": "This product never worked I charged it all day an still it never came on"
      }
    ]
  },
  {
    "title": "Galaxy s III mini SM-G730V Verizon Cell Phone BLUE",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 9,
    "seller": "5f5237a4c1beb1523fa3db73",
    "price": 56.0,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3db1f",
        "rating": 3,
        "comment": "Got phone yesterday all is good so far but only problem i can see is that the charging cable that came w the phone literally came apart in my hands this morning, leaving the metal piece in the phone! Got it out and replaced the cable so hopefully the hubby will be pleased now!"
      }
    ]
  },
  {
    "title": "Galaxy S5 G900A Factory Unlocked Android Smartphone 16GB White",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 10,
    "seller": "5f5237a4c1beb1523fa3da77",
    "price": 222.0,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3db2e",
        "rating": 5,
        "comment": "LOVE IT, IT BIG AND BOLD"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da86",
        "rating": 5,
        "comment": "Great!!"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da34",
        "rating": 3,
        "comment": "The phone works good but sometimes I don't get service."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da3d",
        "rating": 5,
        "comment": "Great"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db20",
        "rating": 5,
        "comment": "Love my new phone, lots of feature and the cost was much cheaper that at the phone store, I really saved a lot."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbae",
        "rating": 4,
        "comment": "The case was in good condition very thick and somewhat protective however when you are taking a picture around the circumference of the picture has a very white blurry look and when I remove the case I realize it was not like that, the case is so thick that the camera is so far Deep inside"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da5f",
        "rating": 5,
        "comment": "I really like it! It has a lot of features and works perfect!"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db30",
        "rating": 4,
        "comment": "The phone is in really good conditions, but I did had some disappointments with this phone. I bought it for my dad and as far as he likes it, it's okay for me. For the money that you pay, it's really good conditions. Thank you"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3daab",
        "rating": 4,
        "comment": "it's boring, bring apps, that i can not uninstall, its memory RAM is wasted"
      }
    ]
  },
  {
    "title": "Galaxy S6 Active - Camo Blue (Unlocked)",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 6,
    "seller": "5f5237a4c1beb1523fa3daff",
    "price": 399.98,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da04",
        "rating": 5,
        "comment": "Is being a month since I bought a galaxys6 active and I haven got any problem thank you"
      }
    ]
  },
  {
    "title": "GreatCall Samsung Jitterbug Touch3 Senior Smartphone with 1-Touch Medical Alert and Large Display",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 2,
    "seller": "5f5237a4c1beb1523fa3da3a",
    "price": 149.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3db13",
        "rating": 4,
        "comment": "Great phone, large display for size of screen, however the battery drain is high."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da79",
        "rating": 2,
        "comment": "It don't work in Salyersville, Ky. I am trying to fix it in a different county in Kentucky."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db6f",
        "rating": 2,
        "comment": "Hard to setup. Difficult to use. Low speaker volume. NOT user friendly."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dac8",
        "rating": 5,
        "comment": "Has all I wanted in a smart phone at a fabulous price. It is just as I expected it to be. I like the size, quality, clarity, and user friendly format."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3daeb",
        "rating": 4,
        "comment": "NOT OVERLY FAMILIAR WITH VERBAGE."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbe9",
        "rating": 5,
        "comment": "Love this phone, everything i need"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbc8",
        "rating": 1,
        "comment": "Seemed fine for my limited use. Transferred numbers and downloaded one app. Received 9/21/15. As of 10/20/15 unusable / inoperable. Won't work even if connected to charger."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da87",
        "rating": 5,
        "comment": "As expected"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db35",
        "rating": 5,
        "comment": "So far I like the phone very much."
      }
    ]
  },
  {
    "title": "LG C410 Xpression 2 Keyboard Messaging Cell Phone - Blue (Unlocked) No Contract",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 4,
    "seller": "5f5237a4c1beb1523fa3da39",
    "price": 149.99,
    "reviews": []
  },
  {
    "title": "Sam Galaxy J7(2016) Dual J7108 4G 16GB Gold",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 3,
    "seller": "5f5237a4c1beb1523fa3db4d",
    "price": 231.0,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3daec",
        "rating": 5,
        "comment": "It works excellent for my needs"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da44",
        "rating": 5,
        "comment": "This phone is nothing but #AWESOME. The picture quality alongside with the initial device itself is great. To be honest, it's worth the price and even my friends like the phone."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db74",
        "rating": 5,
        "comment": "Excellent!! Phone from Samsung. worth of money. As this is the latest 2016 edition which come's with almost new features."
      }
    ]
  },
  {
    "title": "Samsung - Galaxy Young 2 DUOS G130 Unlocked GSM Dual-SIM HSPA+ Phone - White",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 10,
    "seller": "5f5237a4c1beb1523fa3dad3",
    "price": 249.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3dbc4",
        "rating": 3,
        "comment": "Good buy."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db50",
        "rating": 5,
        "comment": "Very good"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db07",
        "rating": 5,
        "comment": "Great product - thanks"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbd1",
        "rating": 3,
        "comment": "Slow phone, but good for price as an extra/spare unit which is why I got it."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dafb",
        "rating": 5,
        "comment": "Excelente.."
      }
    ]
  },
  {
    "title": "Samsung A157 Unlocked GSM Cell Phone with Internet Browser, 3G Capabilities, SMS & MMS and Speakerphone - Black",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 8,
    "seller": "5f5237a4c1beb1523fa3db25",
    "price": 64.0,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3dae5",
        "rating": 3,
        "comment": "We thought the phone was supposed to be new but it seemed refurbished.It arrived fairly quickly after we ordered it - maybe within the weekThe phone worked with the SIM card we bought at 7-11.The only drawback was that the battery was drained after only about 12 hrs and a few short calls, so we needed to charge it every time we got back to the hotel.Didn't use any of the other features ... we just needed to phone to make reservations and meet up with friends"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da50",
        "rating": 4,
        "comment": "The phone is slender and compact but has internet access. A good phone for the price and I would recommend the product."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbdb",
        "rating": 5,
        "comment": "An easy to use basic phone that works on the 3g network. Voice and text are all that I use a phone for so it works great for me!"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db7f",
        "rating": 3,
        "comment": "Its a very basic phone and its what i paid for. Graphics are a little rough and usage is a little difficult."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db19",
        "rating": 1,
        "comment": "My plan for these phones was to take it home to Belize since they were unlocked, but when I get home to Belize, the phones were not actually unlocked. As a matter of fact, I had to pay almost 75% of the purchase price to get it unlocked. Never buy an AT&T unlocked phones, because they really are not, especially to use overseas, they will let you down. They should refund all my money back because it was misrepresentation. It's stinks."
      }
    ]
  },
  {
    "title": "Samsung A257 Unlocked QuadBand Phone with QWERTY Keyboard and Camera - Unlocked Phone - No Warranty - Orange",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 9,
    "seller": "5f5237a4c1beb1523fa3db3f",
    "price": 16.5,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da60",
        "rating": 3,
        "comment": "IT was everything i expected being an older modle,just what i was looking for a good bang for the buck."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbc5",
        "rating": 1,
        "comment": "Worst buy ever. I purchased this phone less than two months and already the phone is malfunctioning. It refuses to make calls. This phone ought to be recalled and customers refunded. UNHAPPY CUSTOMER"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db9a",
        "rating": 4,
        "comment": "Got the phoen it works well, the keys are a bit hard to press but other than that its good..."
      }
    ]
  },
  {
    "title": "Samsung A670 Phone (Verizon Wireless)",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 2,
    "seller": "5f5237a4c1beb1523fa3db52",
    "price": 16.5,
    "reviews": []
  },
  {
    "title": "Samsung A777 Unlocked Phone with 3G Support, 1.3MP Camera, Bluetooth and GPS - US Warranty - Red",
    "brand": "Samsung",
    "image": "imageurl",
    "stock": 2,
    "seller": "5f5237a4c1beb1523fa3dacb",
    "price": 59.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3db12",
        "rating": 5,
        "comment": "Love the fact that I can swap sim cards and have a phone that works in Europe. Didn't even have to unlock it"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dae4",
        "rating": 1,
        "comment": "Product looked good but wouldn't work properly at all. Service was mostly not there. Not the area or the service. It's the phone."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da70",
        "rating": 2,
        "comment": "El teléfono estaba muy sucio y los protectores plasticos más, no tenía buena apariencia y el cargador estaba rayado como si ya se hubiera usado, no quedé satisfecho con el producto.Samsung A777 Unlocked Phone with 3G Support, 1.3MP Camera, Bluetooth and GPS - US Warranty - Red"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da21",
        "rating": 1,
        "comment": "Does not work."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbde",
        "rating": 5,
        "comment": "Husband Love's This Phone Can Not Get Him To Upgrade LOL!!"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db72",
        "rating": 1,
        "comment": "ITS REALLY BAD I bought Samsung A 777 and gave it to my mom, the screen was not working really when turn on the phone the screen turn blue and cant see anythingreally not new"
      }
    ]
  },
  {
    "title": "\"Nokia Asha 302 Unlocked GSM Phone with 3.2MP Camera, Video, QWERTY Keyboard, Wi-Fi, Bluetooth, FM Radio, SNS Integration, MP3/MP4 Player and microSD Slot - White International Version/Warranty",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 8,
    "seller": "5f5237a4c1beb1523fa3da23",
    "price": 299.0,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3dadb",
        "rating": 5,
        "comment": "Phone is working on, I was planning to use it for whatsapp anyway. The oh problem, I can't change the idiom"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db8d",
        "rating": 5,
        "comment": "excellent product in perfect condition"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db56",
        "rating": 5,
        "comment": "excellent"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbe7",
        "rating": 5,
        "comment": "excelente"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db0f",
        "rating": 5,
        "comment": "excelente"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dace",
        "rating": 2,
        "comment": "I like these phone I bought it for my mom and she loves it"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbf2",
        "rating": 2,
        "comment": "It came with arabian keyboard :("
      }
    ]
  },
  {
    "title": "Brand New Nokia 201 Pink RM-800 Factory Unlocked US Warranty GSM 850/1900",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 3,
    "seller": "5f5237a4c1beb1523fa3da7e",
    "price": 299.0,
    "reviews": []
  },
  {
    "title": "Brand New Nokia E75-1 Silver Black Factory Unlocked made in Finland GSM phone",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 2,
    "seller": "5f5237a4c1beb1523fa3da41",
    "price": 299.0,
    "reviews": []
  },
  {
    "title": "Lumia 625 Windows Phone (Unlocked, 8GB, White)",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 0,
    "seller": "5f5237a4c1beb1523fa3da6d",
    "price": 248.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da2d",
        "rating": 4,
        "comment": "like it"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db63",
        "rating": 5,
        "comment": "Excelente..."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbea",
        "rating": 5,
        "comment": "SIN DUDA UNA GRAN INVERSION."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3daca",
        "rating": 1,
        "comment": "I really wanted to love this phone. I loved the windows 8.1 home screen with live tiles and Cortana was excellent. The phone itself was built pretty solid. However, the cons far outweigh the pros. I had to do a hard reset on this phone THREE TIMES within the span of two weeks. First, it would not connect to wifi. Secondly, it kept rebooting itself (one day, it rebooted itself TEN TIMES.) Lastly, the phone was frozen in time one morning. The phone eventually shut off one day and would never turn back on. The phone completely died on me. I don't know if this was a software problem or if it was the phone itself, but I am so disappointed and will never buy a Windows phone again."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db88",
        "rating": 4,
        "comment": "I love this phone. I gave up my Nokia Lumia 1520 because I had to switch back to Sprint and its antenna doesn't work for Sprint. I got an LG G3 which I'm very happy with. But then I missed the Windows phone OS. I missed Cortana, the live tiles, the here maps, the am/fm radio, the rolodex style app list and contacts list and the dedicated camera button. So, I bought this Lumia 625 from this seller. To my pleasant surprise, it came with an orange housing as well. I thought I was only getting a white phone. I was able to update it to WP 8.1, not too easily but after trying for 4-5 times, I got it. I bought a prepaid sim card from AT&T and loaded it up with a $25 monthly charge. The camera isn't so good but that's the only thing negative about this phone. I also missed the 4.7 inch screen that I had with my Galaxy S3 before switching to the 1520 then to G3."
      }
    ],
    "disabled": ""
  },
  {
    "title": "Lumia900 Factory Unlocked Smartphone with Windows Phone 7.5, 8 MP Camera, 4.3-inch Touch Screen, 16 GB Memory and Wi-Fi - No Warranty - Black",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 8,
    "seller": "5f5237a4c1beb1523fa3da16",
    "price": 288.88,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da8b",
        "rating": 5,
        "comment": "This phone is absolutely fantastic for the price, but some potential buyers may not be fully aware of what to expect when it arrives.First off this phone is actually an unlocked AT&T Lumia 900, so there will be AT&T branding on the front. This means that the original packaging will already be opened, as the seller needs to manually unlock the phone before they ship it to you. This does NOT mean that it is a used phone. In order to be able to use non-AT&T sim cards, it is necessary for the seller to contact AT&T to receive an unlock code that frees it from the AT&T network. In my order, there was hardly any sign that it was handled at all, except for maybe a little finger print on the front glass. All the essential documents from AT&T and Nokia were inside the box, as well as a SIM ejector tool and a power cable.As is stated in the description, this phone will work on any HSPA/WCDMA 850/900/1900/2100 MHz/Quad-band data network and any GSM/GPRS/EDGE: 850/900/1800/1900 MHz cellular network, which in turn opens it for carriers in Europe and some in Asia. For US providers, there are currently only 2 major carriers that have GSM networks: AT&T and T-Mobile. There are other smaller carriers that offer services, but they utilize AT&T and T-Mobile towers in their coverage. These carriers include Straight Talk, Red Pocket Mobile, i Wireless, etc., and offer really affordable prepaid plans that I myself utilize. T-Mobile also offers a $30 a month prepaid plan that is rather reasonable.Unfortunately this phone will not work on any CDMA networks, which rules out Verizon, Sprint and US Cellular. For more information on the differences between CDMA and GSM networks, PCMAG.com has a fairly easy to read article explaining the differences between the two.Now onto the phone itself. I must say that I love this phone. It has a fairly decent Amoled 4.3 inch display, with a resolution of only 800x480. In our modern age of 1280×720 and above screens that may seem rather paltry. While using the phone normally it is looks as good as any other screen, but when watching YouTube videos it's lack of pixels becomes apparent. For me I use my iPad and laptop for watching videos so it doesn't matter to me all that much, but for others it may be a deal breaker.The build of the phone is absolutely fantastic. It is made of a solid polycarbonate body that is very resistant to scratches, with a screen made of Corning Gorilla Glass. Needless to say, it is very sturdy. The screen also seems to attract a large number of fingerprints as well, and for some reason is not all that easy to clean off. There is even a YouTube video where a hammer, saw and nail are taken to it and it comes up with little or no damage. The only thing on the phone that seems to be somewhat damageable is the metal piece around the camera lens. After less than 24 hours, there were already little scratches visible. For me I don't really care too much about it, but for others it may be really irritating.The camera itself is 8 megapixels with a Carl Zeiss lens, and it is just ok. There are certainly better phone cameras out there, with the iPhone 5 and Lumia 920 blowing it out of the water. For me it works best outdoors, as indoor shots tend to have more noise for whatever reason.This phone uses Windows Phone 7.5 Mango, so it is not the brand new Windows Phone 8. Sad thing about this phone is that it will never receive an update to Windows Phone 8. The hardware is just unable to fully handle the new OS. Instead it will receive Windows Phone 7.8, which gives it some Windows Phone 8 functionality, such as resizable tiles and the like. But apps in the future will cater just to Windows Phone 8, meaning that those with 7.8 and below will be left out in the cold with newer apps. Again, this isn't a deal breaker for me but for many it will be.One of the things that attracted me to this phone is Nokia Drive. Unlike most smartphone map applications, it does not require data in order to run. Before you set out on a trip you download fully detailed maps onto your phone, and then the built in GPS chip is used to map your location on the map. You can even download state or country specific maps, so you save space by not downloading the entire US map pack. All of this is done without data usage, which is great if you are traveling abroad. Oh, and it is completely free of charge. For travelers like myself, this is an awesome feature. I am also a student, so having a mobile version of Microsoft Office in my pocket is absolutely wonderful, for it allows me to edit documents while on the go.Overall this is a fantastic phone but definitely shows its age (close to one year). However, its awesome build quality as well as fantastic applications for travelers made it a must have for me. It fits my needs well, but potential buyers will need to consider whether it will work well for them."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da1e",
        "rating": 5,
        "comment": "i like it it is very nice .very well.a good gift to my friend.it is really very good.the item is nice."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3daf2",
        "rating": 5,
        "comment": "Just got this phone and all I can say is that it is amazing. People say the camera is one of the weak points. That may be true but I adjusted the settings to 200 for the ISO and 1 for the exposure and the pictures have improved greatly. The simplicity of this phone makes it easy to learn and pick up for anyone. Its a breeze finding things on this phone, no lag, great UI. The live tiles are easy to use and multi-task through. And this phone is blazing fast! enough said."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da12",
        "rating": 3,
        "comment": "Good phone, excellent price. The only problem is the internet sharing because is blocked by AT&T"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db5c",
        "rating": 5,
        "comment": "RECOMMENDED SELLER EXCELLENT PRODUCT"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db49",
        "rating": 4,
        "comment": "does it work in asia?"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da35",
        "rating": 2,
        "comment": "Phone is nice but it is not factory unlocked and I have a lot of problems to have data connection stable in ArgentIna, sometimes work, sometimes do not, then great for who have not a data plan and use wifi but if you one all benefits of the phone take care !!!!!!"
      }
    ]
  },
  {
    "title": "Microsoft Lumia 650 (RM-1154) 16GB White, 5\", Dual Sim, Unlocked International Model, No Warranty",
    "brand": "Nokia",
    "image": "imageurl",
    "stock": 2,
    "seller": "5f5237a4c1beb1523fa3da10",
    "price": 127.95,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3db4a",
        "rating": 5,
        "comment": "so nice"
      }
    ]
  },
  {
    "title": "4G Huawei Honor 6 Plus PE-UL00 FNC 3GB+16GB 5.5 inch FHD EMUI 3.0 (Android 4.4) Smart Phone Octa Core Hisilicon Kirin 925 1.8GHz 3600mAh Dual SIM FDD-LTE WCDMA GSM (White) (International Version)",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 1,
    "seller": "5f5237a4c1beb1523fa3db11",
    "price": 127.95,
    "reviews": []
  },
  {
    "title": "4G-Unlocked Huawei Honor 6 5.0 TFT LTPS Screen 1920 x 1080 pixel 13.0MP Camare Android 4.4.2 Kirin 920 Octa-core Smartphone 3GB RAM+16GB ROM Dual SIM (white) - International Version No Warranty",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 6,
    "seller": "5f5237a4c1beb1523fa3da31",
    "price": 161.06,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3dae7",
        "rating": 4,
        "comment": "Really nice phone, it's not working in USA 2G-3G-4G"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db10",
        "rating": 5,
        "comment": "very good"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da37",
        "rating": 1,
        "comment": "Bad very bad and not support Google play store"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db48",
        "rating": 4,
        "comment": "It's Ok."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da74",
        "rating": 5,
        "comment": "I got it with cover plus Adhesive protection film on both sides"
      }
    ]
  },
  {
    "title": "Google Nexus 6P 64gb Graphite (Black) US Warranty.",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 8,
    "seller": "5f5237a4c1beb1523fa3dabd",
    "price": 161.06,
    "reviews": []
  },
  {
    "title": "Honor 5X Unlocked Smartphone, 16GB Dark Grey (US Warranty)",
    "brand": "Huawei",
    "image": "imageurl",
    "stock": 9,
    "seller": "5f5237a4c1beb1523fa3dae0",
    "price": 199.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3dad6",
        "rating": 4,
        "comment": "price vs performance is very good."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db83",
        "rating": 3,
        "comment": "arrived in 100% flawless condition.BUT the phone design is terrible, the software to be exact is just plain horrible and can only be a 5 star phone if deleting the entire OS to put a basic android on there. The current OS is heavily customised by Huawei and it runs slower than my galaxy S2 from the stone age, my experia Z from the stone age is also better than this, and my zte zmax first gen runs circles around the honor 5x, what were you thinking Huawei???? what, wasted that hardware on poor software, not a smart move."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db44",
        "rating": 5,
        "comment": "Great phone with excellent performance"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dab3",
        "rating": 4,
        "comment": "good phone"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db3b",
        "rating": 2,
        "comment": "I ordered this phone based upon reading the reviews. Overall appeared to be a reasonable featured phone for the list price for which I bought it for. However not sure why NEW phone came with Android 5 and end user was supposed to upgrade to Android 6 just after opening the box. Since I am not a big expert on OS and its compatibility with apps, I did not want to change things on a NEW phone, but it kept bugging me that a upgrade was due. I did that upgrade spending hours on that -- luckily it went smoothly. However I am very DISAPPOINTED to see that CAMERA --> Advance settings --> like ISO settings have just disappeared. There may be other things in other Apps that may have got impacted with this OS upgrade, but don't them as yet."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db66",
        "rating": 4,
        "comment": "Nice and phone but a little slow"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbe5",
        "rating": 5,
        "comment": "This phone works quite well. I mean for the price you really can't get better than this. I've had this for just over a month now and the phone is very responsive, I can access all my apps with ease. It's not the fastest with games, The camera quality and the audio quality aren't the best. But I am totally OK with that considering what I paid for to get this phone"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbd0",
        "rating": 5,
        "comment": "Had this phone for 6 months now. I've had no problems with it. Just put the sim card in and it works great. Very happy I got this instead of the newest iPhone or Samsung for $700. Solid phone. Mine came with a screen saver which is now about at the end of it's life. I use this phone in the field for a highway contractor so it sees plenty of dust and has been dropped at least a dozen times.Placed a tone of music on 32 GB SD Card. If I skip songs it might lag for a few seconds but that has more to do with the card being too full. The storage manager pops up and I clean off the junk and the music player works fine. The FM radio is awesome although I really don't use it often it's nice to have if there were a major earthquake or something else that could take out cell service. Battery lasts over a day for me put I really don't use it much at work. The camera is awesome, might not be as good as the latest iPhone but I saved $500. Camera has a professional setting which you can change the exposure, white balance., etc. The pictures look great on social media posts."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da55",
        "rating": 5,
        "comment": "Great phone for the price works all the time! No problems"
      }
    ]
  },
  {
    "title": "Alltel LG AX390 AX-390 AX 390 SPECIAL FOR PAGE PLUS",
    "brand": "LG",
    "image": "imageurl",
    "stock": 5,
    "seller": "5f5237a4c1beb1523fa3db3d",
    "price": 199.99,
    "reviews": []
  },
  {
    "title": "AT&T LG CU405 No Contract Push To Talk Quad Band GSM Global Cell Phone Black",
    "brand": "LG",
    "image": "imageurl",
    "stock": 8,
    "seller": "5f5237a4c1beb1523fa3da3c",
    "price": 64.95,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3db1c",
        "rating": 1,
        "comment": "Not good, stopped working after 2 weeks, next time buy new or refurbished stuff. Waste of money to buy used item that stops working shortly after purchase and this is second time it happened."
      }
    ]
  },
  {
    "title": "AT&T LG Neon GT365BLS QWERTY Camera Phone",
    "brand": "LG",
    "image": "imageurl",
    "stock": 0,
    "seller": "5f5237a4c1beb1523fa3dad9",
    "price": 64.95,
    "reviews": []
  },
  {
    "title": "'ATT Wireless LG CU720 Shine for in Red'",
    "brand": "LG",
    "image": "imageurl",
    "stock": 9,
    "seller": "5f5237a4c1beb1523fa3db5a",
    "price": 25.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3db7c",
        "rating": 5,
        "comment": "all good"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db24",
        "rating": 5,
        "comment": "Very happy with this phone ,,it almost looks brand new. arrived on time."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db42",
        "rating": 4,
        "comment": "I love this phone; the Shine in general. This particular phone works well. It does shut off without notice. Overall, it's a great phone!"
      }
    ]
  },
  {
    "title": "Cu515 Black Flip",
    "brand": "LG",
    "image": "imageurl",
    "stock": 0,
    "seller": "5f5237a4c1beb1523fa3da07",
    "price": 13.33,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da11",
        "rating": 5,
        "comment": "Great!"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da6f",
        "rating": 5,
        "comment": "ty"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dad8",
        "rating": 2,
        "comment": "THE FLIP HINGE BROKE JUST LIKE THE OTHER 3 I HAD. FINALLY JUST CHANGED PHONE MODEL"
      }
    ]
  },
  {
    "title": "ENV2 VX9100 MAROON VERIZON CDMA NO CONTRACT",
    "brand": "LG",
    "image": "imageurl",
    "stock": 0,
    "seller": "5f5237a4c1beb1523fa3da29",
    "price": 79.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da94",
        "rating": 5,
        "comment": "Just as described. Super fast delivery. Daughter loves the new phone."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3daf7",
        "rating": 1,
        "comment": "I love this phone and had one myself for many years. So when my daughter needed a phone I thought this would be a great one for her since she is too young for a smart phone. However, this is the second phone I have bought from them and BOTH phones stopped working unless they are plugged into the charger. Even with a full battery they still shut off as soon as they are unplugged. VERY frustrating and very disappointed. Also when I received the ENV2 I looked it over and it looks as though it had water damage prior to me getting it."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3daea",
        "rating": 4,
        "comment": "I bought this phone for my 10 year old daughter for Christmas 2012. This phone works great without any issues. Its small enough for her small hand bag and just right for a preteenie."
      }
    ]
  },
  {
    "title": "LG 240 FLIP UNLOCKED QUADBAND GSM CAMERA MEMORY CARD CELLPHONE. WORKS ALL OVER THE WORLD",
    "brand": "LG",
    "image": "imageurl",
    "stock": 5,
    "seller": "5f5237a4c1beb1523fa3daa5",
    "price": 69.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da0f",
        "rating": 1,
        "comment": "I bought the LG 240 phone for my dad who lives overseas and when he put it to charge it did not charge. It could be the battery, Don't waist your $40+ on this phone. And the seller says that they test them before it leaves the factory, I was literally call a lier. I still going to see if I can get it back to return it."
      }
    ]
  },
  {
    "title": "LG 2X P999 8GB Unlocked GSM Phone with Android 2.3 OS, HDMI, Nvidia Tegra 2 Dual Core processor, 8MP Camera, IPS LCD Touchscreen, GPS, Wi-Fi, Bluetooth, FM Radio and microSD Slot - Brown",
    "brand": "LG",
    "image": "imageurl",
    "stock": 10,
    "seller": "5f5237a4c1beb1523fa3dab9",
    "price": 108.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3daf4",
        "rating": 5,
        "comment": "I've had my G2X from the year it first launched and when it finally gets beat up to the point where I need a new one (I'm rough on phones), I order the same one. No upgrading or changing for me. It works nicely. Never have trouble!!"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da6b",
        "rating": 2,
        "comment": "This phone does not live up to how it is promoted. My husband has a cheapLG that will run on 3G and this phone is advertised for 4G but wouldn't evenrun at 2G. The Seller was very easy to work with and I would not hesitate tobuy from them again. They sent me an email to see if I was satisfied withthe product and did not hesitate to give me a full refund when I asked for it."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da54",
        "rating": 5,
        "comment": "Ordered my phone after looking at for a couple days,am very impressed by the quality of the phone, arrived on time and am loving it"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dba0",
        "rating": 5,
        "comment": "its amazing how some people say the phone is crap and other people say it's great, we have had nothing but positive things to say about it.Gave it to my wife for her first android smart phone.She reminds me how much she likes it.battery last long, very fast, feels good in your hand, the only thing I can get a negative is that it needs a message light.don't get hung up on software updates 2.3 .5 works great. Have added 400 songs I'm still have 4gig to go on memory.hotspot and wifi works perfect.after researching just about all phone this 1 seems like the best deal.Enjoy it. We do."
      }
    ]
  },
  {
    "title": "Apple - Iphone 5c A1532 Verizon 16 GB Cell Phone - Green",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 0,
    "seller": "5f5237a4c1beb1523fa3da08",
    "price": 33.0,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da4c",
        "rating": 5,
        "comment": "Was a gift for my husband and he loves it. Replaced a first gen droid so there was no place to go but up.The phone came in a plain white box with charging cable. It looked brand new and unused.So far it has performed as a new phone with no troubles whatsoever."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da83",
        "rating": 5,
        "comment": "Great price, extremely fast shipping works as advertized!"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dab2",
        "rating": 4,
        "comment": "Moving from Android to Apple...my kids have this phone too and keep me straight on using it. Phone is superb and, while Apple has its moments, it is intuitive to use. Seller was VERY responsive...only reason not a 5 star is \"new\" phone had been opened for imei verification. Not sure that's industry standard. If it is, seller is 5 star."
      }
    ],
    "disabled": ""
  },
  {
    "title": "Apple - Iphone 5c A1532 Verizon 16 GB Cell Phone - White",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 9,
    "seller": "5f5237a4c1beb1523fa3daad",
    "price": 33.0,
    "reviews": []
  },
  {
    "title": "Apple A1533 Unlocked iPhone 5S Smart Phone, 16 GB (White)",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 7,
    "seller": "5f5237a4c1beb1523fa3db4f",
    "price": 115.0,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3db6a",
        "rating": 5,
        "comment": "Love it. Excellent condition and beautifully packaged."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da57",
        "rating": 5,
        "comment": "Excellent purchasing experience. Item just as described, new and in original packaging. Speedy shipping too!"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db80",
        "rating": 1,
        "comment": "this cellphone scren is locked ,needed to enter pin , I don‘t know why ,anyonecan gime a advice?"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db68",
        "rating": 5,
        "comment": "Awesome phone, mine came and there were no scratches on it and it was 100% fully functional."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db54",
        "rating": 5,
        "comment": "excellent"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db69",
        "rating": 5,
        "comment": "It's going great"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da93",
        "rating": 5,
        "comment": "Just the right phone"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db23",
        "rating": 4,
        "comment": "Very few scratches and works great. Wonderfully fast shipping and nice service."
      }
    ]
  },
  {
    "title": "Apple iPad Pro ML0N2CL/A (128GB Wi-Fi Space Gray) (International Model no Warranty)",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 5,
    "seller": "5f5237a4c1beb1523fa3dad7",
    "price": 115.0,
    "reviews": []
  },
  {
    "title": "Apple iPhone 2G 8GB (Black)",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 3,
    "seller": "5f5237a4c1beb1523fa3da02",
    "price": 129.0,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3db0c",
        "rating": 1,
        "comment": "Charger not work"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da49",
        "rating": 4,
        "comment": "yes indeedit was in good shapthanks"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da9a",
        "rating": 5,
        "comment": "Totally awesome iPhone great condition works great, will buy from seller again he was very insightful"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbcf",
        "rating": 5,
        "comment": "Works as advertised"
      }
    ]
  },
  {
    "title": "Apple iPhone 3G 8GB (Black) - AT&T",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 0,
    "seller": "5f5237a4c1beb1523fa3db85",
    "price": 24.6,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3db81",
        "rating": 3,
        "comment": "Average quality"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db2f",
        "rating": 1,
        "comment": "I was looking for it to be bigger"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbb3",
        "rating": 5,
        "comment": "Excellent, fast, delivery."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db79",
        "rating": 5,
        "comment": "Love it"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbaa",
        "rating": 4,
        "comment": "I just got my phone and plugged it in the charger sent and it wouldn't work. Plugged it in with my charger for my current iPhone 3GS. Still wouldn't charge then finally plugged it into my ihone and it started charging. The phone was completely dead when I got it and has finally come on so I know it at least works how well I'm not sure as I am waiting for it to charge completely. It did not come in a box like they said but that's ok I already have an iPhone box as I bought mine new for $1.06 when I signed on to my 3 year contract. At that time the phones had just come out. Ill update my listing once I mess with the phone. There were light scratches on the back but nothing gastly just normal wear."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db02",
        "rating": 5,
        "comment": "I love this phone but, somebody stole it"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbd7",
        "rating": 1,
        "comment": "Disappointed in the phone"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db08",
        "rating": 2,
        "comment": "Bought as a gift but didn't work and couldn't return because it was pasted the 14 day policy! Lesson learned! 😡"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3daba",
        "rating": 2,
        "comment": "Had water damage inside phone"
      }
    ]
  },
  {
    "title": "Apple iPhone 3GS 16GB (Black) - AT&T MC135LL/A",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 0,
    "seller": "5f5237a4c1beb1523fa3dabb",
    "price": 30.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da42",
        "rating": 1,
        "comment": "The phone does not hold a charge at all.I cant take it off the charger or it will die even when it says 100%"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da78",
        "rating": 5,
        "comment": "So it's not the newest phone out there, so what. This phone was cheaper than getting an iPod of same GB size. It's an apple product so good support, good apps."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da26",
        "rating": 5,
        "comment": "This classic iPhone has the old school shape and weight, with plenty of performance. I'm one for simplicity and the classic 3GS is a solid buy."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da97",
        "rating": 5,
        "comment": "It performs great. I would recommend it to anyone that wants an iphone, but can't afford the latest one out there."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dac3",
        "rating": 1,
        "comment": "Product in good condition but incomplete, because i miss miss accessories had the doubt if so go on and buy it had bought a better one because i had to make additional spending"
      }
    ]
  },
  {
    "title": "Apple iPhone 3GS 16GB (White) - AT&T",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 6,
    "seller": "5f5237a4c1beb1523fa3db1d",
    "price": 53.0,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3dac0",
        "rating": 1,
        "comment": "Horrible . This was the worst iPhone I've ever bought . I couldn't even connect to MY wifi in the set up . Total waste of money ! The screen was shattered and I couldn't even get past the set up . Don't waste your time with this seller ! Just buy an iPhone 5s at Walmart on Straighttalk for $199 !"
      }
    ]
  },
  {
    "title": "Apple iPhone 3GS 8GB Black Factory Unlocked / Not Jailbroken",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 7,
    "seller": "5f5237a4c1beb1523fa3db5d",
    "price": 33.0,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da17",
        "rating": 1,
        "comment": "When I received the iphone,i found it is fake and inferior product,the back cover is renovated,the receiver has a noise when you have a call,screen light-leaking,in a word,it is a bad iphone."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da0e",
        "rating": 5,
        "comment": "Yes I like my 3G first I can't connect to Internet but finally I got it and I happy with my selection thank you very much"
      }
    ]
  },
  {
    "title": "Apple iPhone 3GS A1303 16GB GSM Unlocked SmartPhone - Black",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 1,
    "seller": "5f5237a4c1beb1523fa3dbf0",
    "price": 39.0,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da75",
        "rating": 1,
        "comment": "I had purchased this as a replacement for a 3gs phone that I apparently used as a basketball too often. I had to return it because several features did not work. I subsequently ordered a 4s, an upgrade at a similar price which works fine."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db7b",
        "rating": 4,
        "comment": "I was skeptical about buying the unlock iPhone 3GS from Amazon after seeing the bad reviews, but I checked with the seller and went ahead and purchased it after he confirmed it. I gotta say, I'm very happy with this purchase. It wasn't hard to set up the sim's card into the device. It came in the mail like it was brand new with the original packaging and everything. I love texting and calling my friends and family with it. I have experienced the white screen of death, but I restarted it without a second thought and everything has been fine ever since. I haven't really experience any serious heating problems and I've played some high capacity games on it while being plugged in. It does get rather warm in the hands, but it wasn't enough to be uncomfortable for me. The main reason why I got this phone was because I wanted an easier and more convenient way to call and text my friends and family. The phone I had before was a flip phone without a proper keyboard. This does what I want and so much more. For $115, I got a really good deal and I'm happy to say that I'll be using this until my dad stops paying for the contract or it does die out on me. Just to let those who have flip phones know, the iPhone 3GS can PREVENT data being used when you're not on that plan. The flip phone that I had would take me onto the web without warning me first and that caused my phone to be charged a few extra dollars for just a few seconds of being on the internet. At least now, I don't have to worry about those slippages because I can only use data when i'm using wi-fi.I don't really have any complaints for this phone because it's more then what I want in an phone, but as an Apple product, I have to say that the screen really takes a miss. I'm so spoiled by Retina Display on my iPod Touch 5g, that it bugs me when everything is in low resolution. When comparing watching videos or pictures, it's just ain't the same. It's good when I'm bored at college, but for casual use, it's not that great from today's standards.It's a little bulky, but I kind of like it that way. It gives it a feel to it and it doesn't slip out of my hands unlike the new iPod Touch.Seeing that I got the white screen of death on the second day scared me. I'm hoping that wasn't the reason why the seller sold it to me.Summery:Pros:Great for a phone and great for texting.Has great cellular connection.Satisfying battery life.Can handle playing games without taking too much heat.Can prevent using data on cellular network unlike my old flip phone.Cons:Poor screen quality compared to today's standard for Apple products.Sort of bulky, but having some weight is a pro for me.White screen of death on the second day of using it."
      }
    ]
  },
  {
    "title": "Apple iPhone 4 - 8GB, BLACK, Net 10 Ready, USE VERIZON'S NETWORK!",
    "brand": "Apple",
    "image": "imageurl",
    "stock": 4,
    "seller": "5f5237a4c1beb1523fa3da6c",
    "price": 208.79,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da15",
        "rating": 4,
        "comment": "So far the iPhone 4 from this seller has been working as promised."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dacd",
        "rating": 1,
        "comment": "It didn't come with all the things it said was with the phone."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db38",
        "rating": 1,
        "comment": "Net10 does NOT support this phone...I have no idea what they were thinking...had to go to verizon...love the phone...hate verizon..Not happy!"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db9f",
        "rating": 2,
        "comment": "This is a nice phone, but it is not net ten ready it can only be serviced through Verizon. I learned that the hard way and bought everything for net ten and spent two days trying to activate it to find out you can only use Verizon ."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dacc",
        "rating": 1,
        "comment": "Phone works with network. But old technology does not allow for apps. Phone screen cracked on arrival but not enough to interrupt use. Screen cracks easily and in general phone seems cheap. Great for kids or as inexpensive option if you can't afford newest phones but you get what you pay for"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbeb",
        "rating": 1,
        "comment": "Didn't work for my area Disappointed returned it"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db8b",
        "rating": 5,
        "comment": "it works great"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da7b",
        "rating": 3,
        "comment": "Was not for Net10 but was ready for Straight Talk. Also did not come with all the extra stuff which I think I should be either refunded some money or sent the stuff as promised. Awesome phones though in really good condition and got here pretty fast. Me and my girlfriend do enjoy them but the information is wrong."
      }
    ]
  },
  {
    "title": "AT&T Motorola RAZR V3 No Contract Quad Band GSM Camera Cell Phone Pink",
    "brand": "Motorola",
    "image": "imageurl",
    "stock": 6,
    "seller": "5f5237a4c1beb1523fa3dbdd",
    "price": 26.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da67",
        "rating": 1,
        "comment": "Not good"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbd9",
        "rating": 1,
        "comment": "junk did not work got a refund"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dab8",
        "rating": 3,
        "comment": "I love the looks of it but,it has no S.D.slot...and I wanted to change all my personal stand stuff to the phone and couldn't!!!"
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db8f",
        "rating": 4,
        "comment": "Got phone it had no scratches but can't find where the micro ed card goes but it came in really fast my mom will love it and it came and day early for mother's day it was cheap and affordable"
      }
    ]
  },
  {
    "title": "AT&T Motorola RAZR V3xx No Contract Cell Phone 3G",
    "brand": "Motorola",
    "image": "imageurl",
    "stock": 9,
    "seller": "5f5237a4c1beb1523fa3da9b",
    "price": 179.1,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da2b",
        "rating": 5,
        "comment": "Very excited by my purchase! I replaced a worn out Motorola Razr with this one and was very pleased to find it in great shape for a used phone. It also arrived much sooner than I expected."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da82",
        "rating": 5,
        "comment": "I bought this as a replacement phone for my father who doesn't want a smart phone. He's with AT&T and even if you disable a smartphone's data connection you still have a monthly headache when they charge you for having a smartphone."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db0b",
        "rating": 4,
        "comment": "Although this is a old style phone I have had 3 of them over the years. They are easy to use & reliable,& have all the functions I currently need in a cell phone."
      }
    ]
  },
  {
    "title": "Factory Unlocked Motorola Droid Turbo Special Edition - Ballistic Nylon 64GB - Factory unlocked for worldwide GSM network",
    "brand": "Motorola",
    "image": "imageurl",
    "stock": 9,
    "seller": "5f5237a4c1beb1523fa3db14",
    "price": 469.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3da48",
        "rating": 5,
        "comment": "It works just fine. I was concerned about how the pictures would look because I hate grainy pictures, but this is ok. Pictures are nice and clear but you have to be still when taking them."
      }
    ]
  },
  {
    "title": "DASH HTC s620 s621 UNLOCKED WI-FI WORLD PHONE S 620",
    "brand": "HTC",
    "image": "imageurl",
    "stock": 8,
    "seller": "5f5237a4c1beb1523fa3db96",
    "price": 469.99,
    "reviews": []
  },
  {
    "title": "HTC 1 X Unlocked GSM Android Smartphone with Beats Audio Sound and Front-Facing Speakers - White",
    "brand": "HTC",
    "image": "imageurl",
    "stock": 0,
    "seller": "5f5237a4c1beb1523fa3dbf1",
    "price": 89.99,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3db36",
        "rating": 5,
        "comment": "This is truly a lovely android phone. The touch screen is very responsive...I can't find anything to complain about. Oh, maybe the charger, its tricky."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbc0",
        "rating": 2,
        "comment": "Sound quality while calling is very poor, need to use earphone . Also the phone gets heated up when we use simple applications as well, also after you charged the phone. When i googled i saw people having same problems. I just found out , one of my colleauge had literally exchanged this phone from the carrier 4 times. So HTC has real bad problem with this phone."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3daf9",
        "rating": 5,
        "comment": "Everything OK, I have been using you guys for a while now. I am truly impressed by your service,it really is Awesome."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3db98",
        "rating": 1,
        "comment": "i ordered a new phone i peid 325$ for new one and i'm exited to get it, but what i see the phone which came was used!!!!!!!!! and i order and peid for new one.! it was teribble i'm relly angry"
      }
    ]
  },
  {
    "title": "HTC 10 (Carbon Gray) - 32GB",
    "brand": "HTC",
    "image": "imageurl",
    "stock": 0,
    "seller": "5f5237a4c1beb1523fa3da2e",
    "price": 799.98,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3db51",
        "rating": 1,
        "comment": "This phone has stopped recognizing the sim card and not able to get telephone call signal....DO NOT WASTE TIME TO BUY THIS."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dafa",
        "rating": 1,
        "comment": "had a crack on the screen when arrived......."
      }
    ]
  },
  {
    "title": "New 5.5\"Sony Xperia C4 E5333 Black Factory Unlocked International Version no warranty",
    "brand": "Sony",
    "image": "imageurl",
    "stock": 6,
    "seller": "5f5237a4c1beb1523fa3da85",
    "price": 799.98,
    "reviews": []
  },
  {
    "title": "New Hatsune Miku Limited Edition SO-04e MK (Official unlocked mobile phone) (Limited Green)",
    "brand": "Sony",
    "image": "imageurl",
    "stock": 4,
    "seller": "5f5237a4c1beb1523fa3daf5",
    "price": 799.98,
    "reviews": []
  },
  {
    "title": "Nokia N97 Unlocked Phone with Touchscreen, 3G, 5 MP Camera, A-GPS, 32 GB, MicroSD Slot, and Integrated Ovi Applications--U.S. Version with Warranty (White)",
    "brand": "Sony",
    "image": "imageurl",
    "stock": 0,
    "seller": "5f5237a4c1beb1523fa3daae",
    "price": 269.1,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3dbd2",
        "rating": 4,
        "comment": "Tengo una semana de estar utilizando este teléfono celular. Es mi primer Nokia y al principio fue un poco frustrante por que no sabía donde buscar las aplicaciones, yo estaba acostumbrado a los celulares Sony Ericksson y me sentía muy cómodo con ellos pero por las características que presentaba el N97 su gran cantidad de memoria ser de tecnología 3G, los buenos comentarios que había escuchado y por precio decidí comprarlo en lugar de un Sony Ericksson.Como mencioné al principio me frustré pero era mas por desconocimiento que otra cosa por ejemplo le instalé el navegador Opra mini ya que el navegador que el trae no me gustaba pero cuando me conectaba a Internet lo hacía atravez del navegador predeterminado y yo no sabía que tenía que entrar a aplicaciones y de ahí accesar a Opra. Pero poco a poco fui encontrandole las aplicaciones y debo decir que ahora estoy muy contento.Las cosas buenas de este celular:1) Esteticamente es muy lindo, la resolución de la pantalla hace que las imágenes se vean muy nítidas.2)La cámara y el video no tienen nada que envidiarle a un artefacto dedicado es decir a una cámara digital o a una videocamara, las fotos son muy bien logradas y el flash realmente funciona en lugares oscuras se pueden apreciar perfectamente los detalles.3) La conexión a Internet es muy buena, gracias al zoom puedes agrandar o disminuir la imágenes las cuales se aprecian muy bien, logicamente hay páginas que por ser tan grandes no se observaran como en la computadora, pero en realidad la navegación es placentera siempre y cuando no tengas que estar digitando algo.4) Conectarte a las redes sociales o a tu correo electrónico esta a un click de distancia y como dige antes en segundos y puedes leer archivos en formato de word excel o PDF. Es decir si no estas cerca a de una computadora no hay ningún problema te sacará del apuro, aunque repito la experiencia aun no es como con la computadora pero ese es un problema en todos los teléfono inteligentes. Yo reviso mis estados de cuenta, puedo hacer una compra en Amazon pagar recibos entrar al banco hacer transacciones, etc, etc.5) El teléfono es robusto se ve fuerte aunque aun no se ha llevado ningún golpe6) Tiene todas las funciones de los teléfonos convencionales pero a diferencia de otros estas realmente cumplen por ejemplo si tienes una grabadora tu esperas que cuando des click esta realmente grabe y esta lo hace, yo he tenido telefonos que cuando quise usar la grabadora esta simplemente no funcionó. Puedes vivar con ello pero da cólera que una aplicación no funcione como debiera.Pero bueno no todo es perfecto y lo que no me gustó es lo incómodo que resulta a veces el teclado qwerty a veces cuando estoy navegando si por alguna razón tengo que digitar algo puedo desplegar texto en pantalla pero en otras ocasiones esta característica no esta disponible y me obliga a usar el teclado y no se si es la falta de costumbre pero soy mucho mas diestro con las teclas de un teléfono que con este tipo de teclado y me demoro mucho por lo que me resulta engorroso. Pero bueno no se talvez dentro de unos meses ya me halla acostumbrado.Pero por lo demás creo que son mucho mas las satisfacciones imaginense pueden utilizar este teléfono como un GPS yo en la particular no lo uso por que ya tengo un Garmin que es una belleza y al cual ya estoy super acostumbrado pero bueno esta es una aplicación que bien vale la pena utilizar si esta disponible. En sintesís le digo comprelo no se va a arrepentir, a y se me olvidaba la pantalla táctil funciona a las mil maravillas esta era una de mis principales dudas, pero me di cuenta que si funciona y excelentemente bien, el secreto es calibrarla la pantalla a tu gusto, si gustas de apretar mucho el lápiz pues así la calibras a mi me gustan los trazos suaves y así la calibré y apenas dejo caer el lápiz y la función se aplica. Así es que es una buena inversión la única razón por la que no le dí cinco estrellas fue por la razón del teclado por lo demás no hay quejas."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dbf4",
        "rating": 4,
        "comment": "Big and heavy. It is difficult to configure access to web. Excellent sound and screen resolution."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3da06",
        "rating": 2,
        "comment": "This is an expensive phone with three major problems for which I gave it a two-star. First, the reception is much weaker comparing to my old phone (Motorola Ming). Once the reception is lost, it could take a minute or more for you to be able to see some signal bars appeared again. Second, the connection is another issue for this cell phone. It gives a lot of \"connection error\" messages, and I have experienced way more call drops since I changed to this cell phone. Also, the home screen rotates easily from vertical to horizontal, but it doesn't do the same backward. I have to shake the phone with some strength for the home screen rotate back to vertical. Overall, I am very disappointed with Nokia N97, but since I paid a good amount of money for it, I have to stick with it for a while."
      },
      {
        "reviewer": "5f5237a4c1beb1523fa3dac6",
        "rating": 5,
        "comment": "I am very satisfied with this phone. Works great on AT&T 3G & EDGE networks. The Ovi Store is a great app store that allows you to download apps, themes, and other content for your Nokia phone safely. I would not recommend installing any apps that are not through the Ovi Store. I did and ended up having to reset my phone, losing some of the content that came originally on the phone. Great phone, though. Only drawback I have noticed is that depending on how you hold the phone, sometimes your voice comes across muffled to the person you are on the phone with."
      }
    ],
    "disabled": ""
  },
  {
    "title": "Nokia N97 Unlocked Phone, Touchscreen, 3G, 5 MP Camera, A-GPS, 32 GB, MicroSD Slot, and Integrated Ovi Applications--U.S. Version with Warranty (Black)",
    "brand": "Sony",
    "image": "imageurl",
    "stock": 10,
    "seller": "5f5237a4c1beb1523fa3dac9",
    "price": 173.0,
    "reviews": [
      {
        "reviewer": "5f5237a4c1beb1523fa3db2b",
        "rating": 3,
        "comment": "I bought my N97 from Amazon in July, but since day one it shuts down on me at least once a day. This is really annoying specially when it does not turn back on immediately. Besides this inconvenience, the N97 is really a great phone with nice features and a much easier to use touchscreen when compared to the Iphone."
      }
    ]
  },
  {
    "title": "Sony Ericsson TM506 Unlocked QUAD-Band 3G GSM Cell Phone",
    "brand": "Sony",
    "image": "imageurl",
    "stock": 0,
    "seller": "5f5237a4c1beb1523fa3da68",
    "price": 173.0,
    "reviews": [],
    "disabled": ""
  }
]